#!/usr/bin/env python
# -*- coding: utf-8 -*-


__author__ = 'James Iter'
__date__ = '16/06/08'
__contact__ = 'james.iter.cn@gmail.com'
__copyright__ = '(c) 2016 by James Iter.'


own_state_branch = {
    # ----------以上将集成至jimit库中------------
    '40450': {
        'code': '40450',
        'zh-cn': u'目标操作系统模板未找到'
    },
    '40451': {
        'code': '40451',
        'zh-cn': u'目标操作系统初始化操作未找到'
    },
    '41250': {
        'code': '41250',
        'zh-cn': u'验证签名失败'
    },
    '41251': {
        'code': '41251',
        'zh-cn': u'起止IP必须在同一个网段中'
    },
    '41252': {
        'code': '41252',
        'zh-cn': u'网关必须与将分配给Guest的IP，处于同一个网段中'
    },
    '41253': {
        'code': '41253',
        'zh-cn': u'网关不能是网络地址或广播地址'
    },
    '41254': {
        'code': '41254',
        'zh-cn': u'起始的可用IP地址必须小于结束的可用IP地址'
    },
    '41255': {
        'code': '41255',
        'zh-cn': u'磁盘大小超出范围'
    },
    '41256': {
        'code': '41256',
        'zh-cn': u'欲删除的磁盘正在被使用中'
    },
    '41257': {
        'code': '41257',
        'zh-cn': u'扩容必须大于当前磁盘空间大小'
    },
    '41258': {
        'code': '41258',
        'zh-cn': u'欲挂载的磁盘已被别的实例使用'
    },
    '41259': {
        'code': '41259',
        'zh-cn': u'Guest 暂时不可用'
    },
    '41260': {
        'code': '41260',
        'zh-cn': u'Guest 与 磁盘不在同一宿主机上'
    },
    '41261': {
        'code': '41261',
        'zh-cn': u'Guest 状态不符合预期，期望 Guest 为关闭状态'
    },
    '41262': {
        'code': '41262',
        'zh-cn': u'仍有 Guest 在此 Vlan 中，期望该 Vlan 中不存在任何 Guest'
    },
    '50050': {
        'code': '50050',
        'zh-cn': u'MySQL 链接或执行出错'
    },
    '50350': {
        'code': '50350',
        'zh-cn': u'无可用IP地址，请联系 JimV 管理员'
    },
    '50351': {
        'code': '50351',
        'zh-cn': u'无可用计算节点，请联系 JimV 管理员'
    },
}
